Repository: Mahaaldajaanii/MiniChallenge3
Catalog: *.lproj/Localizable.strings
Languages: ar

source: Sara Ahmed
ar: سارة احمد

source: Softwar Engineering
ar: هندسه البرمجيات

source: 5 Participants
ar: المشاركون ٤

source: Networks Fundamentals
ar: مبادئ شبكات

source: 3 Participants
ar: المشاركون ٣

source: Database management
ar: اداره قواعد البيانات

source: Security and Policy
ar: الأمن والسياسة

source: 4 Participants
ar: المشاركون ٤

source: System Analysis
ar: تحليل النظم

source: Operating System
ar: نظام التشغيل

source: Computer Programming 1
ar: برمجة ١

source: Networks Fundamentals
ar: اساسيات الشبكات

source: 4 Groups Created
ar: ٤ مجموعات منشأة

source: see More
ar: شاهد المزيد

source: In love with technology👩🏻‍💻💞,I’ve been coding
ar: واقعة في حب التكنولوجيا 👩🏻‍💻💞، بدات كتابة الاكواد

source: since I was In high school✨.
ar: منذ كنت في المرحلة الاعدادية ✨

source: Riyadh,SA
ar: الرياض

source: Information Tencholgy
ar: تقنية معلومات

source: Eidt
ar: اضافة

source: Created
ar: المنشاة

source: Joined
ar: المنظم اليها

source: Participant
ar: المشاركون

source: Requests
ar: الطلبات

source: Accept
ar: قبول

source: Delet
ar: حذف

source: Description
ar: الوصف

source: Sunday
ar: الأحد

source: pm
ar: مساءً

source: 12/6/2022,pm
ar: ١٢/٦/٢٠٢٢، مساءً

source: Central Library ,second floor
ar: المكتبة المركزية - الدور الثاني-

source: In this study group we will discuss chapter 3
ar: سوف تناقش هذه المجموعة الدراسية الفصل الثالث

source: See more
ar: المزيد

source: Nora Faisal
ar: نوره فيصل

source: Asmaa Saad
ar: أسماء سعد

source: Shahed Fahad
ar: شهد فهد

source: Nada Salem
ar: ندى سالم

source: Privacy
ar: الخصوصية

source: Accessibilty
ar: إمكانية الوصول

source: Language
ar: تغيير اللغة

source: Security
ar: الأمان

source: About us
ar: عن التطبيق

source: Study Groups
ar: المجموعات الدراسية

source: Computer siences
ar: علوم حاسب

source: Notifications
ar: الإشعارات

source: Logout
ar: تسجيل خروج

source: Sun 12/6/2022
ar: الأحد ٢٠٢٢/٦/١٢

source: 2-3 PM
ar: ٢-٣ مساء

source: Tue 14/6/2022
ar: الثلاثاء ٢٠٢٢/٦/١٤

source: 8-10 AM
ar: ٨-١٠ صباح

source: Wed 15/6/2022
ar: الأربعاء ٢٠٢٢/٦/١٥

source: 12-2 PM
ar: ١٢-٢ مساء

source: 9-11 AM
ar: ٩-١١ صباح

source: See All
ar: الجميع

source: Ready for next study group?
ar: جاهز للمجموعة الدراسية القادمة؟

source: Hours
ar: ساعات

source: Minutes
ar: دقائق

source: Seconds
ar: ثواني

source: 8 Participants
ar: ٨ مشاركين

source: 12 Participants
ar: ١٢ مشارك

source: 16 Participants
ar: ١٦ مشارك

source: 21 Participants
ar: ٢١ مشارك

source: 14 Participants
ar: ١٤ مشارك

source: 26 Participants
ar: ٢٦ مشارك

source: 6 Participants
ar: ٦ مشاركين

source: 18 Participants
ar: ١٨ مشارك

source: 11 Participants
ar: ١١ مشارك

source: 33 Participants
ar: ٣٣ مشارك

source: 7 Participants
ar: ٧ مشاركين

source: 23 Participants
ar: ٢٣ مشارك

source: 2 Participants
ar: ٢ مشاركين

source: Information Security
ar: أمن المعلومات

source: Satellites
ar: أقمار صناعية

source: Introduction to IT and IS
ar: مقدمة الى تقنية ونظم المعلومات

source: Human Computer Interaction
ar: التفاعل بين الانسان والحاسب

source: Wireless Networks Security
ar: أمن الشبكات اللاسلكية

source: WEB Technologies
ar: تقنيات الويب

source: Computer Orgnization
ar: تنظيم الحاسب

source: Database Management
ar: ادارة قواعد البيانات

source: Information Technology
ar: تقنية معلومات
